{
  "lastUpdated": "2026-02-14T04:25:26Z",
  "articles": [
    {
      "id": "amtrak-pdf-portal-north-bridge-2026-02-14",
      "title": "[PDF] Portal North Bridge Track Cutover Work - Amtrak Media",
      "url": "https://media.amtrak.com/wp-content/uploads/2026/01/Portal-Cutover-Presentation-1.15.26.pdf",
      "source": "Amtrak Media",
      "author": null,
      "date": "2026-02-14",
      "category": "official",
      "excerpt": "Amtrak will perform a critical series of construction and operational activities to transfer, or “cut over,” rail operations from one track on the existing Portal Bridge to one track on the new Portal North Bridge over the Hackensack River. During this work, trains will only be able to operate on a single track between Newark and Secaucus. This cutover represents a major milestone in the Gateway...",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "njtransit-transit-2026-02-14",
      "title": "NJ TRANSIT",
      "url": "https://www.njtransit.com/press-releases/portal-north-bridge-enters-final-phase-construction-work-begins-put-first-track",
      "source": "NJ Transit",
      "author": null,
      "date": "2026-02-14",
      "category": "official",
      "excerpt": "PORTAL NORTH BRIDGE ENTERS FINAL PHASE OF CONSTRUCTION AS WORK BEGINS TO PUT FIRST TRACK INTO SERVICE \\| New Jersey Public Transportation Corporation NEWARK, NJ — Beginning February 13, Amtrak will perform critical work to transfer one track of rail service from the century-old Portal Bridge to the new Portal North Bridge over the Hackensack River. A major milestone in the Gateway Program, the...",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "njtransit-portalcutover-page",
      "title": "Portal Bridge Cutover: What It Means For You",
      "url": "https://www.njtransit.com/portalcutover",
      "source": "NJ Transit",
      "author": null,
      "date": "2026-02-13",
      "category": "official",
      "excerpt": "NJ Transit's official Portal Bridge cutover information hub. Includes temporary schedules for all affected lines, cross-honoring details for PATH, NY Waterway ferry, and Bus 126, FLEXPASS options, and real-time service alerts. The definitive source for schedule changes during Feb 15 – Mar 15, 2026.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "nytimes-bridge-snarl-2026-02-13",
      "title": "New Jersey Bridge Project Could Snarl Rail Traffic for a Month",
      "url": "https://www.nytimes.com/2026/02/13/nyregion/portal-bridge-nj-transit.html",
      "source": "The New York Times",
      "author": null,
      "date": "2026-02-13",
      "category": "news",
      "excerpt": "The Portal North Bridge cutover begins this weekend, with NJ Transit and Amtrak reducing service by approximately 50% for four weeks. Single-track operations between Newark and Secaucus will create a bottleneck affecting hundreds of thousands of daily commuters.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "northjersey-starting-sunday-itll-2026-02-13",
      "title": "Starting Sunday, it'll be harder to get to NY by train. What to expect",
      "url": "https://www.northjersey.com/story/news/transportation/2026/02/13/nj-transit-train-schedule-change-portal-bridge-amtrak/88660470007/",
      "source": "NorthJersey.com",
      "author": null,
      "date": "2026-02-13",
      "category": "news",
      "excerpt": "Rail service into New York will be reduced for a month as Amtrak shifts train operations from the 110-year-old Portal Bridge to the newly constructed Portal North Bridge over the Hackensack River, a key milestone in the Gateway Program. The “cutover” work, scheduled from Feb. 15 through March 14, will temporarily limit trains to a single track between Newark and Secaucus. As a result, fewer...",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "njbiz-portal-cutover-2026-02-12",
      "title": "Portal North Bridge cutover to disrupt NJ Transit service",
      "url": "https://njbiz.com/portal-north-bridge-cutover-nj-transit-amtrak/",
      "source": "NJBIZ",
      "author": null,
      "date": "2026-02-12",
      "category": "news",
      "excerpt": "NJ Transit and Amtrak riders face a month of significant service reductions beginning February 15 as crews work to connect the new Portal North Bridge to the Northeast Corridor. The cutover represents a critical milestone in the $2.3 billion Gateway Program project.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "montclairgirl-service-reduction-2026-02-12",
      "title": "NJ Transit To Reduce Service to New York Penn Station Through March 15",
      "url": "https://www.themontclairgirl.com/nj-transit-reduce-service-new-york-penn-station-february-2026/",
      "source": "The Montclair Girl",
      "author": null,
      "date": "2026-02-12",
      "category": "community",
      "excerpt": "NJ Transit will reduce service to New York Penn Station through March 15 as part of the Portal North Bridge cutover. Montclair-Boonton Line riders face the biggest changes, with all weekday trains diverted to Hoboken Terminal.",
      "lines": [
        "montclair-boonton"
      ],
      "direction": "nj-to-nyc"
    },
    {
      "id": "abc7-portal-cutover-2026-02-12",
      "title": "What the Portal Bridge cutover means for NJ Transit, Amtrak commuters",
      "url": "https://abc7ny.com/post/commuter-alert-portal-bridge-construction-will-cause-nj-transit-amtrak-service-changes-4-weeks/18588218/",
      "source": "ABC7 New York",
      "author": null,
      "date": "2026-02-12",
      "category": "news",
      "excerpt": "Starting February 13, Amtrak will initiate the first phase of transferring rail service from the century-old Portal Bridge to the newly constructed Portal North Bridge. All rail lines except the Atlantic City Rail Line will face temporary service adjustments beginning Sunday, February 15, lasting approximately four weeks. NJ Transit CEO Kris Kolluri noted that when the existing bridge gets stuck opening for marine traffic, manual intervention is sometimes required.",
      "lines": [
        "montclair-boonton",
        "morris-essex",
        "northeast-corridor",
        "north-jersey-coast"
      ],
      "direction": "both"
    },
    {
      "id": "news12-portal-cutover-2026-02-12",
      "title": "Portal Bridge 'cutover' project to impact NJ Transit services. Here's what it means for you.",
      "url": "https://newjersey.news12.com/portal-bridge-cutover-project-to-impact-nj-transit-services-heres-what-it-means-for-you",
      "source": "News 12 New Jersey",
      "author": "Matt Trapani and Lauren Due",
      "date": "2026-02-12",
      "category": "news",
      "excerpt": "Amtrak will commence operations on February 15 to shift train traffic from the current Portal Bridge to the newly constructed Portal North Bridge spanning the Hackensack River. Single-track train operations will be the only option available between Newark and Secaucus during the roughly one-month transfer period. All Midtown Direct service will be redirected to Hoboken, with PATH cross-honoring and enhanced ferry service through New York Waterway during peak commute periods.",
      "lines": [
        "montclair-boonton",
        "morris-essex"
      ],
      "direction": "nj-to-nyc"
    },
    {
      "id": "nytimes-evening-commute-2026-02-12",
      "title": "For Workers Heading to New Jersey, the Evening Commute Just Got Harder",
      "url": "https://www.nytimes.com/2026/02/12/nyregion/nj-transit-evening-commute-portal-bridge.html",
      "source": "The New York Times",
      "author": "Patrick McGeehan",
      "date": "2026-02-12",
      "category": "news",
      "excerpt": "The Portal Bridge cutover doesn't just affect morning commuters heading into Manhattan. Evening riders heading home to New Jersey face their own set of challenges: fewer trains from Penn Station on NEC and North Jersey Coast lines, and a complete reroute through Hoboken for Midtown Direct riders. Commuters heading to Morris County and the Montclair area will need to take PATH or ferry to Hoboken, then catch their NJ Transit train home.",
      "lines": [
        "montclair-boonton",
        "morris-essex",
        "northeast-corridor",
        "north-jersey-coast"
      ],
      "direction": "nyc-to-nj"
    },
    {
      "id": "6sqft-com-transit-cut-2026-02-12",
      "title": "NJ Transit to cut service by 50% for four weeks",
      "url": "https://www.6sqft.com/nj-transit-to-cut-service-by-50-for-four-weeks/",
      "source": "6sqft.com",
      "author": null,
      "date": "2026-02-12",
      "category": "news",
      "excerpt": "NJ Transit to cut service by 50% for four weeks The project in 2024. Photo courtesy of Amtrak New Jersey Transit riders will have a tough time reaching New York City for the next month. Starting Sunday, February 15, NJ Transit will cut service by 50 percent for four weeks to transfer rail operations from one track on the 115-year-old Portal Bridge to one track on the new $1.5 billion Portal North...",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "tapinto-morristown-2026-02-11",
      "title": "Morristown Line riders: Here's your Portal Bridge survival guide",
      "url": "https://www.tapinto.net/towns/morristown/articles/portal-bridge-cutover-morristown-line",
      "source": "TAPinto Morristown",
      "author": null,
      "date": "2026-02-11",
      "category": "community",
      "excerpt": "Morris & Essex Line riders face major changes starting February 15 as all weekday Midtown Direct trains are diverted to Hoboken Terminal. Morristown, Madison, Chatham, Summit, and Short Hills commuters will need to learn new transfer options at Hoboken to reach Manhattan. NJ Transit is cross-honoring tickets on PATH trains, NY Waterway ferries, and Bus 126 during the cutover period.",
      "lines": [
        "morris-essex"
      ],
      "direction": "nj-to-nyc"
    },
    {
      "id": "northjersey-its-going-2026-02-11",
      "title": "It's going to be harder soon to get to New York via train. Here's why",
      "url": "https://www.northjersey.com/story/news/transportation/2026/02/11/nj-transit-service-cuts-starting-for-construction-heres-where/88622464007/",
      "source": "NorthJersey.com",
      "author": null,
      "date": "2026-02-11",
      "category": "news",
      "excerpt": "Feb. 11, 2026Updated Feb. 12, 2026, 1:29 p.m. ET Rail service into New York will be reduced for a month as Amtrak shifts train operations from the 110-year-old Portal Bridge to the newly constructed Portal North Bridge over the Hackensack River, a key milestone in the Gateway Program. The “cutover” work, scheduled from Feb. 15 through March 14, will temporarily limit trains to a single track...",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "pix11-portal-cutover-2026-02-10",
      "title": "NJ Transit alters schedules for Portal Bridge work",
      "url": "https://pix11.com/news/local-news/final-construction-of-new-portal-bridge-requires-month-of-service-changes-for-commuters/",
      "source": "PIX11 News",
      "author": "Greg Mocker",
      "date": "2026-02-10",
      "category": "news",
      "excerpt": "Final construction of the new Portal Bridge requires a month of service changes for commuters. NJ Transit rail lines and Amtrak will be disrupted for 4 weeks as crews work to connect the new Portal North Bridge to the Northeast Corridor.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "hobokengirl-path-delays-2026-02-10",
      "title": "PATH Riders Advised to Prepare for Delays from February 15th - March 15th",
      "url": "https://www.hobokengirl.com/path-delays-hoboken-jersey-city-february-2026-nj/",
      "source": "Hoboken Girl",
      "author": null,
      "date": "2026-02-10",
      "category": "community",
      "excerpt": "PATH riders in Hoboken and Jersey City should prepare for increased crowding and potential delays as thousands of NJ Transit riders are diverted to Hoboken Terminal during the Portal Bridge cutover. The Hoboken-to-33rd Street line will absorb most of the additional passenger load.",
      "lines": [
        "montclair-boonton",
        "morris-essex"
      ],
      "direction": "nj-to-nyc"
    },
    {
      "id": "nj1015-service-reduction-2026-02-10",
      "title": "4 weeks of hell start Sunday: What to know as NJ Transit cuts 50% of trains",
      "url": "https://nj1015.com/nj-transit-service-reduction/",
      "source": "New Jersey 101.5",
      "author": "Dan Alexander",
      "date": "2026-02-10",
      "category": "news",
      "excerpt": "NJ Transit will implement a significant service cut beginning February 15 for four weeks, affecting roughly half of all rail service into New York as crews transition signals and overhead wires to the new Portal North Bridge. Engineering teams will require 40,000 man-hours to complete the switchover, operating across two shifts daily with 70-90 workers per shift. The disruption is necessary for the final phase of the $1.5 billion Portal North Bridge replacement project.",
      "lines": [
        "montclair-boonton",
        "morris-essex",
        "northeast-corridor",
        "north-jersey-coast",
        "raritan-valley"
      ],
      "direction": "both"
    },
    {
      "id": "nytimes-portal-bridge-2026-02-10",
      "title": "A Critical Bridge Is Getting Replaced. Hundreds of Thousands of Commuters Will Feel It.",
      "url": "https://www.nytimes.com/2026/02/10/nyregion/portal-bridge-nj-transit-cutover.html",
      "source": "The New York Times",
      "author": "Patrick McGeehan",
      "date": "2026-02-10",
      "category": "news",
      "excerpt": "The Portal Bridge, a 115-year-old swing bridge over the Hackensack River, has been the Northeast Corridor's most notorious chokepoint for decades. Now, as Amtrak finally replaces it with the new Portal North Bridge, NJ Transit riders face a month of significant service reductions. The cutover is a milestone in the long-delayed Gateway Program and could eventually eliminate one of the most common causes of delays on the entire corridor.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "tapinto-montclair-2026-02-10",
      "title": "What Montclair commuters need to know as trains shift to Hoboken",
      "url": "https://www.tapinto.net/towns/montclair/articles/portal-bridge-cutover-montclair-commuters",
      "source": "TAPinto Montclair",
      "author": null,
      "date": "2026-02-10",
      "category": "community",
      "excerpt": "For Montclair-area commuters who have relied on Midtown Direct service to Penn Station, the February 15 shift to Hoboken represents a fundamental change in their daily routine. All weekday trains on the Montclair-Boonton Line will now terminate at Hoboken Terminal, where riders must transfer to PATH, ferry, or Bus 126. The good news: Hoboken tickets cost less than Penn Station tickets, and the PATH/ferry transfer is cross-honored at no additional cost.",
      "lines": [
        "montclair-boonton"
      ],
      "direction": "nj-to-nyc"
    },
    {
      "id": "tapinto-red-bank-2026-02-10",
      "title": "Red Bank commuters face longer commutes as North Jersey Coast Line cuts service",
      "url": "https://www.tapinto.net/towns/red-bank/articles/portal-bridge-cutover-north-jersey-coast",
      "source": "TAPinto Red Bank",
      "author": null,
      "date": "2026-02-10",
      "category": "community",
      "excerpt": "Red Bank and surrounding Shore communities on the North Jersey Coast Line will see train service reduced by about 15% during the Portal Bridge cutover. While trains still run to Penn Station, the single-track operations between Newark and Secaucus mean delays of 15-30 minutes or more during peak hours. NJ Transit has released temporary schedules that eliminate several popular trains.",
      "lines": [
        "north-jersey-coast"
      ],
      "direction": "both"
    },
    {
      "id": "lackawannacoalition-org-portal-north-bridge-cutover-2026-02-08",
      "title": "Portal North Bridge Cutover Brings Schedule Changes Later This Winter – Lackawanna Coalition",
      "url": "https://lackawannacoalition.org/2026/02/08/portal-north-bridge-cutover-brings-schedule-changes-later-this-winter/",
      "source": "lackawannacoalition.org",
      "author": null,
      "date": "2026-02-08",
      "category": "news",
      "excerpt": "The new Portal North Bridge located west of Secaucus Station is essentially ready for service, and NJ Transit has plans to start using it.  Cutting over from the existing bridge, which is more than 100 years old, is a complex process that will require single-track operation between Newark Penn Station and Secaucus Junction Station. Although trains coming from Broad Street Station in Newark enter...",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "njtransit-press-release-2026-02-05",
      "title": "NJ Transit announces temporary schedules and cross-honoring agreements for Portal Bridge cutover",
      "url": "https://www.njtransit.com/press-releases/portal-bridge-cutover-schedules",
      "source": "NJ Transit",
      "author": null,
      "date": "2026-02-05",
      "category": "official",
      "excerpt": "NJ Transit today released temporary schedules for all affected rail lines during the Portal North Bridge cutover period (February 15 – March 15, 2026). Key highlights include cross-honoring agreements with PATH, NY Waterway, and NJ Transit Bus 126 for riders diverted to Hoboken Terminal. Enhanced NY Waterway ferry service will operate from Hoboken during peak commuting hours.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "nytimes-gateway-context-2026-02-05",
      "title": "The Portal Bridge: Why Replacing a 115-Year-Old Drawbridge Matters for the Northeast",
      "url": "https://www.nytimes.com/2026/02/05/nyregion/portal-bridge-history-gateway-program.html",
      "source": "The New York Times",
      "author": "Patrick McGeehan",
      "date": "2026-02-05",
      "category": "analysis",
      "excerpt": "The Portal Bridge has been the bane of Northeast Corridor commuters for decades. The 115-year-old swing bridge over the Hackensack River gets stuck while opening for marine traffic, causing cascading delays that can ripple for hours. Its replacement — the $1.5 billion Portal North Bridge — will be a modern, fixed-span bridge that eliminates the movable component entirely. The cutover is the final step in bringing the new bridge online.",
      "lines": [
        "all"
      ],
      "direction": "both"
    },
    {
      "id": "nj-spotlight-portal-north-2026-01-16",
      "title": "NJ Transit to cut some service to NY for repairs",
      "url": "https://www.pbs.org/video/headline-c-portal-north-1768590364/",
      "source": "NJ Spotlight News",
      "author": null,
      "date": "2026-01-16",
      "category": "news",
      "excerpt": "Commuters should brace for major disruptions on rail lines serving New York. Starting February 15, NJ Transit and Amtrak will reduce train service by over 50 percent for a four-week period to connect the new $2.3 billion Portal North Bridge to the Northeast Corridor. More than 600 daily trains will be affected in the Newark-to-Secaucus corridor that feeds into Penn Station.",
      "lines": [
        "northeast-corridor",
        "north-jersey-coast",
        "montclair-boonton",
        "morris-essex"
      ],
      "direction": "both"
    },
    {
      "id": "amtrak-press-release-2026-01-15",
      "title": "Portal North Bridge Enters Final Phase of Construction as Work Begins to Put First Track into Service",
      "url": "https://media.amtrak.com/2026/01/portal-north-bridge-enters-final-phase-of-construction-as-work-begins-to-put-first-track-into-service/",
      "source": "Amtrak Media",
      "author": null,
      "date": "2026-01-15",
      "category": "official",
      "excerpt": "Beginning February 13, 2026, Amtrak will transfer one track of rail service from the 115-year-old Portal Bridge in Kearny, NJ to the new Portal North Bridge over the Hackensack River. This Gateway Program milestone requires a multi-week reduction in Amtrak and NJ Transit service in New Jersey and the Northeast Corridor. Amtrak President Roger Harris called the cutover 'a whole new level of reliability on the Northeast Corridor.'",
      "lines": [
        "all"
      ],
      "direction": "both"
    }
  ]
}
